Revit 2024 API
CompoundStructure.EndCap Property
 Indicates the end cap condition defining which shell layers will participate in end wrapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public EndCapCondition EndCap { get; set; }
Visual Basic
Public Property EndCap As EndCapCondition
	Get
	Set
Visual C++
public:
property EndCapCondition EndCap {
	EndCapCondition get ();
	void set (EndCapCondition value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace